def decrypt(symbols, number):
    bukvi = 'АБВГДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ'
    decrypt = ""
    for char in symbols:
        if char in bukvi:
            shifted_index = (bukvi.index(char) - number) % len(bukvi)
            decrypt += bukvi[shifted_index]
        else:
            decrypt += char
    return decrypt

symbols = "НСУСХНГКФХСУЙЬРГЖСЕКЖНГСФРСЕЙХЗСУКЛПРСІЙРДЦОЙЇГНОГЖЗРКЕКЖСПЙПРКПЗЩАНЙППГХЗПГХЙНСПЄЗСУЄСПНГРХСУСПЦЖУЦЄКМТСОСЕЙРКПЙРЦОСЄСФХСОКХХВТСВЕГХЗСУКЛПРСІЙРДЦОГЇЦФХУКРЦХГЇЗРХЦЇКГЇПСПДГЄГХАПГГЕХСУЙХЗХРЙПЙПГХЗПГХЙНГПЙЕСРЙТСДГЬЙОЙЕРКМПСІОЙЕКФХАФХЕСУЗРРВПЗХГПСЕЙПГХЗПГХЙНЙХСДХСЧСУПГОАРСЛСЖРСФХГМРСЛФЙФХЗПЙТСРВХАКТУЙРЩЙТКЕЇГЖСТСПСЄСБВНСЛПСІРГДЦОСДЕЙНОГФХЙЇИЖЙРЙШТСЇЙЩКМЇПКФХУКЇРСПГРКХРЙШХУГЖЙЩКМРСЖГОЗНЙШСЖЙРЕКЖСЖРСЄСУСЇЖКОКЕПГХЗПГХЙНЙТЗУЮКХГНКЖСФЙХАЦФТКЮРКФТУСДЙДЦОЙЕЙНСРГРКЕІЗРЗЇГДГУСПТКФОВЕЙРЙНРЗРРВНГРХСУКЕФАНСЛХЗСУКЛПРСІЙР"
number = 3

decrypt = decrypt(symbols, number)
print(decrypt)
